test_reports/performance_profiling_nodeprofiler/output7.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/labs/list
Document Length:        27 bytes

Concurrency Level:      20
Time taken for tests:   0.225 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      89750 bytes
HTML transferred:       6750 bytes
Requests per second:    1111.75 [#/sec] (mean)
Time per request:       17.990 [ms] (mean)
Time per request:       0.899 [ms] (mean, across all concurrent requests)
Transfer rate:          389.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   17   7.0     15      41
Waiting:        2   17   7.0     15      41
Total:          3   17   7.0     15      41

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     16
  75%     17
  80%     17
  90%     27
  95%     36
  98%     41
  99%     41
 100%     41 (longest request)