test_reports/performance_profiling_nodeprofiler/output9.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/roles/3b6d9bbc-fddc-456a-aa19-224c0f724e24
Document Length:        27 bytes

Concurrency Level:      20
Time taken for tests:   0.140 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      89750 bytes
HTML transferred:       6750 bytes
Requests per second:    1786.54 [#/sec] (mean)
Time per request:       11.195 [ms] (mean)
Time per request:       0.560 [ms] (mean, across all concurrent requests)
Transfer rate:          626.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   10   1.3     11      14
Waiting:        2   10   1.4     11      14
Total:          4   10   1.3     11      14

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     11
  80%     11
  90%     12
  95%     12
  98%     13
  99%     13
 100%     14 (longest request)