test_reports/performance_profiling_nodeprofiler/unassignUserFromLab.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/labs/unassign
Document Length:        33 bytes

Concurrency Level:      20
Time taken for tests:   0.106 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      90500 bytes
HTML transferred:       8250 bytes
Requests per second:    2359.92 [#/sec] (mean)
Time per request:       8.475 [ms] (mean)
Time per request:       0.424 [ms] (mean, across all concurrent requests)
Transfer rate:          834.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3    8   2.3      7      18
Waiting:        1    8   2.3      7      18
Total:          3    8   2.3      7      18

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      9
  80%      9
  90%     10
  95%     12
  98%     16
  99%     17
 100%     18 (longest request)